{
  "backend/main.mo": "Main actor implementing user profile management with registration and retrieval functions, enforcing authorization checks via MixinAuthorization and AccessControl for user and admin permissions.",
  "feature_evidence.json": "Feature evidence report documenting three implemented features: ProfilePage component at /profile route, Profile navigation link for authenticated users, and automatic user registration on Internet Identity authentication.",
  "frontend-file-summaries.txt": "Comprehensive summaries of frontend files including components, pages, hooks, and utilities for the Carzzz car toys e-commerce application with authentication and profile management.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes using OKLCH color space, defining design tokens for backgrounds, foregrounds, borders, and component-specific colors.",
  "frontend/index.html": "HTML entry point with page title 'Carzzz - Premium Car Toys' and root div for React application mounting.",
  "frontend/src/App.tsx": "Main application component configuring TanStack Router with routes for home, products, contact, order, and profile pages, including Layout wrapper with Navigation, Footer, and conditional UserProfileSetup modal for authenticated users without profiles.",
  "frontend/src/components/Footer.tsx": "Footer component displaying Carzzz branding, quick navigation links, social media icons, copyright notice, and Caffeine.ai attribution with UTM tracking.",
  "frontend/src/components/Navigation.tsx": "Sticky header navigation with Carzzz logo, desktop and mobile menus, active route highlighting, and conditional Profile link visible only to authenticated users.",
  "frontend/src/components/OrderForm.tsx": "React component that renders a shipping information form with fields for name, email, phone, and address, using a custom useOrderForm hook for validation and submission handling.",
  "frontend/src/components/OrderSummary.tsx": "Displays an order summary card showing product image, pricing breakdown (unit price, quantity, total), and additional information like free shipping and delivery time.",
  "frontend/src/components/ProductCard.tsx": "Renders a product card with image, name, description, price, and an order button that links to the order page for that product.",
  "frontend/src/components/ProductCategory.tsx": "Displays a category section with title, description, and a grid of ProductCard components, with customizable color themes (accent, gold, silver).",
  "frontend/src/components/UserProfileSetup.tsx": "Modal dialog component that prompts users to enter their name for profile setup, using a mutation hook to save the profile data.",
  "frontend/src/data/mockProducts.ts": "Contains mock product data for sport cars, hyper sport cars, and F1 cars with IDs, names, descriptions, prices, categories, and image paths.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages an authenticated or anonymous actor instance for backend communication, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for login/logout functionality, managing auth client creation and identity state throughout the application.",
  "frontend/src/hooks/useOrderForm.ts": "Custom React hook that manages order form state, validation (email, phone, postal code), and error handling for customer shipping information.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching products by category, submitting contact inquiries, and managing user profile data via the backend actor.",
  "frontend/src/index.css": "Global CSS with Tailwind imports, custom automotive-themed color palette (light/dark modes), Google Fonts (Orbitron, Rajdhani), and utility classes for gold/silver accents.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/ContactPage.tsx": "Contact form page with validation, submission handling via useSubmitInquiry mutation, success messaging, and static contact information display.",
  "frontend/src/pages/HomePage.tsx": "Landing page with hero banner, call-to-action buttons, and features section highlighting premium quality, exclusive collection, and other selling points.",
  "frontend/src/pages/OrderPage.tsx": "Order checkout page that displays product details, quantity selection, order form, order summary, and success confirmation with mock order number generation.",
  "frontend/src/pages/ProductsPage.tsx": "Displays product collection page with three categories (Sport Cars, Hyper Sport Cars, F1 Cars) using React Query hooks to fetch and render products with loading and error states.",
  "frontend/src/pages/ProfilePage.tsx": "Renders authenticated user profile page showing name, email, and registration timestamp, with login prompt for unauthenticated users and loading skeletons during data fetch.",
  "frontend/src/types/product.ts": "Defines Product interface and Category enum (SportCars, HyperSportCars, F1Cars) for type-safe product data handling.",
  "frontend/src/utils/urlParams.ts": "Provides utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions including OKLCH color system, custom fonts (Rajdhani, Orbitron), premium shadows, and animation keyframes.",
  "project_state.json": "Project state tracking document showing completed features for profile page, authentication, and auto-registration, with pending backend user profile storage requirements."
}