{
  "backend/main.mo": "Empty Motoko actor with a comment indicating explicit migration is required to drop persistent storage state.",
  "feature_evidence.json": "Feature evidence report documenting six implemented features for the order page functionality, including routing, form fields, order summary, validation, order placement, and ProductCard navigation updates.",
  "frontend-file-summaries.txt": "JSON object containing one-sentence summaries of all frontend files, describing components, pages, hooks, types, and configuration for the Carzzz car toy e-commerce application.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes using OKLCH color space, defining design tokens for backgrounds, borders, accents, and component styling.",
  "frontend/index.html": "HTML entry point with page title 'Carzzz - Premium Car Toys' and root div for React application mounting.",
  "frontend/src/App.tsx": "Main application component configuring TanStack Router with routes for home, products, contact, and order pages, wrapped in a layout with navigation and footer.",
  "frontend/src/components/Footer.tsx": "Footer component displaying Carzzz branding, quick navigation links, social media icons, copyright notice, and Caffeine.ai attribution with UTM tracking.",
  "frontend/src/components/Navigation.tsx": "Sticky header navigation with Carzzz logo, desktop and mobile menu support, active route highlighting, and responsive design.",
  "frontend/src/components/OrderForm.tsx": "Order form component with customer information fields (name, email, phone, address), quantity selector with increment/decrement controls, validation, and submission handling with loading state.",
  "frontend/src/components/OrderSummary.tsx": "Displays a sticky order summary card showing product image, unit price, quantity, total price calculation, and additional order benefits like free shipping and delivery time.",
  "frontend/src/components/ProductCard.tsx": "Renders an individual product card with image, name, description, price, and an order button that links to the order page for that product.",
  "frontend/src/components/ProductCategory.tsx": "Displays a category section with title, description, and a grid of ProductCard components, supporting different color themes (accent, gold, silver).",
  "frontend/src/data/mockProducts.ts": "Contains mock product data for Sport Cars, Hyper Sport Cars, and F1 Cars categories with IDs, names, descriptions, prices, and image paths.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages an ICP backend actor with authentication, automatically invalidating and refetching dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for login, logout, and identity management with AuthClient integration and delegation handling.",
  "frontend/src/hooks/useOrderForm.ts": "Custom hook managing order form state with validation for name, email, phone, address fields including regex-based validation for email, phone, and postal codes.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching products by category and submitting contact inquiries, currently using mock implementations with simulated network delays.",
  "frontend/src/index.css": "Global CSS file that imports Google Fonts (Orbitron and Rajdhani), configures Tailwind directives, and defines extensive CSS custom properties for a premium automotive-themed color palette supporting both light and dark modes with gold/silver accent utilities.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient for data fetching and InternetIdentityProvider for authentication, then renders the main App component.",
  "frontend/src/pages/ContactPage.tsx": "Contact page component with a form for submitting inquiries (name, email, message) including validation, success state handling, and display of contact information (email, phone, address) with icons.",
  "frontend/src/pages/HomePage.tsx": "Landing page featuring a hero section with banner image and call-to-action buttons, plus a features section highlighting premium quality, exclusive collection, and other benefits with icons.",
  "frontend/src/pages/OrderPage.tsx": "Order page that displays product details, quantity selection, order form, and order summary; handles order submission and shows success confirmation with order number and estimated delivery.",
  "frontend/src/pages/ProductsPage.tsx": "Products catalog page that fetches and displays products organized by three categories (Sport Cars, Hyper Sport Cars, F1 Cars) using ProductCategory components with loading and error states.",
  "frontend/src/types/product.ts": "TypeScript type definitions for products including Category enum (SportCars, HyperSportCars, F1Cars) and Product interface with id, name, description, price, category, and optional image fields.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom fonts (Rajdhani, Orbitron), extensive color system using OKLCH color space, custom border radius variables, premium shadow utilities, and animation keyframes.",
  "project_state.json": "Project state file for Carzzz e-commerce website deployed on Internet Computer blockchain with Motoko backend. Tracks 7 completed features for product ordering functionality including order page, form validation, and navigation."
}