{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add member-only profile page for registered users",
  "requirements": [
    {
      "id": "REQ-9",
      "summary": "Create a ProfilePage component at route /profile that displays authenticated user information including registration timestamp",
      "acceptanceCriteria": [
        "ProfilePage component is created and accessible at /profile route",
        "Page displays user's Internet Identity principal",
        "Page displays registration date/time",
        "Page is only accessible to authenticated users",
        "Unauthenticated users are prompted to log in via Internet Identity"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/ProfilePage.tsx",
          "operation": "create",
          "description": "Create ProfilePage component that displays authenticated user's profile information including principal ID and registration timestamp. Use the authorization component's getCallerUserProfile backend capability to fetch user data. Show loading state while fetching, display user information when authenticated, and prompt login via Internet Identity when unauthenticated. Format the registration timestamp as a human-readable date. Verify the authorization component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Register /profile route in the router configuration using createRoute. Import and wire ProfilePage component to the new route. Ensure the route is added to the routeTree alongside existing routes (home, products, contact, order)."
        }
      ]
    },
    {
      "id": "REQ-10",
      "summary": "Add a Profile navigation link in the Navigation component visible only to authenticated members",
      "acceptanceCriteria": [
        "Profile link appears in navigation menu only when user is authenticated",
        "Link navigates to /profile route",
        "Link is hidden when user is not logged in"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Navigation.tsx",
          "operation": "modify",
          "description": "Add a conditional Profile link to the navigation menu that only renders when the user is authenticated. Use the useInternetIdentity hook to check authentication state via the identity property. Add the link to both desktop and mobile navigation menus after the existing links. Apply active state styling consistent with other navigation links. The link should navigate to /profile route."
        }
      ]
    },
    {
      "id": "REQ-11",
      "summary": "Automatically register users when they first authenticate with Internet Identity",
      "acceptanceCriteria": [
        "User registration is automatically created upon first authentication",
        "Registration timestamp is recorded",
        "Subsequent logins do not create duplicate registrations"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useUserRegistration.ts",
          "operation": "create",
          "description": "Create a custom React hook that manages automatic user registration on first login. Use the authorization component's getCallerUserProfile backend capability to check if the user has an existing profile, and registerAndStoreUser backend capability to register new users. Implement this as a React Query mutation that runs after authentication. Include logic to prevent duplicate registrations by checking profile existence first. Return registration status and any errors. Verify the authorization component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/UserProfileSetup.tsx",
          "operation": "create",
          "description": "Create a modal component that prompts new users to enter their name upon first login. Use the useUserRegistration hook to handle profile creation. Display a form with a name input field and submit button. Show loading state during submission and handle errors gracefully. Use the authorization component's saveCallerUserProfile backend capability to save the user's name. Close the modal after successful registration. Verify the authorization component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Import and integrate UserProfileSetup component into the main App component. Use the authorization component's getCallerUserProfile backend capability to determine if profile setup is needed. Show the UserProfileSetup modal when a user is authenticated but has no profile. Implement the logic to prevent modal flash by checking both authentication state and profile fetch status before rendering the modal. Follow the authorization component's pattern for preventing profile setup modal flash using custom isLoading and isFetched states."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add a React Query hook useGetCallerUserProfile that fetches the authenticated user's profile using the authorization component's getCallerUserProfile backend capability. Implement proper loading state handling that accounts for actor initialization to prevent modal flash. Return custom state with isLoading that includes actorFetching state, and isFetched that checks both actor availability and query completion. Follow the authorization component's pattern for preventing profile setup modal flash. Verify the authorization component's usage instructions before implementing."
        }
      ]
    }
  ]
}